src/1c/src/InformationRegisters/СтатусыКурьерскихЗаявок/СтатусыКурьерскихЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКурьерскихЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКурьерскихЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КурьерскаяЗаявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/1c/src/Enums/СтатусыКурьерскихЗаявок/СтатусыКурьерскихЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКурьерскихЗаявок</name>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>ЖдетНазначенияКурьера</name>
  </enumValues>
  <enumValues>
    <name>УКурьера</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/1c/src/Documents/КурьерскаяЗаявка/КурьерскаяЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяЗаявка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/1c/src/CommonModules/КурьерскиеЗаявкиИнтеграция/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтправитьДанныеПоЗаявке(Заявка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Сообщение = СервисыИнтеграции.КурьерскиеЗаявки.СоздатьСообщение();
	ВспомогательныйШина.ПоместитьОбъектВТелоСообщения(Сообщение, ДанныеЗаявкиВФормате(Заявка));
	СервисыИнтеграции.КурьерскиеЗаявки.Основной_КурьерскиеЗаявки_Channel1CSource.ОтправитьСообщение(Сообщение);

КонецПроцедуры


Функция ДанныеЗаявкиВФормате(ЗаявкаСсылка) Экспорт

	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	КурьерскаяЗаявка.Ссылка КАК Ссылка,
	|	КурьерскаяЗаявка.Автор КАК Автор,
	|	КурьерскаяЗаявка.Адрес КАК Адрес,
	|	Isnull(КурьерскаяЗаявка.Курьер.Наименование, Неопределено) КАК Курьер,
	|	КурьерскаяЗаявка.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(СтатусыКурьерскихЗаявокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКурьерскихЗаявок.Создана)) КАК
	|		Статус,
	|	КурьерскаяЗаявка.Автор.Наименование КАК АвторНаименование
	|ИЗ
	|	Документ.КурьерскаяЗаявка КАК КурьерскаяЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКурьерскихЗаявок.СрезПоследних КАК СтатусыКурьерскихЗаявокСрезПоследних
	|		ПО СтатусыКурьерскихЗаявокСрезПоследних.Заявка = КурьерскаяЗаявка.Ссылка
	|ГДЕ
	|	КурьерскаяЗаявка.Ссылка = &Ссылка";
	ЗапросДанных.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	РезультатЗапроса = ЗапросДанных.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	ДанныеОтвета = Новый Структура(
		"id,authorId,authorName,address,courierName,comment,status",
		XMLСтрока(Выборка.Ссылка),
		XMLСтрока(Выборка.Автор),
		Выборка.АвторНаименование,
		Выборка.Адрес,
		Выборка.Курьер,
		Выборка.Комментарий,
		XMLСтрока(Выборка.Статус)
	);
	Возврат ДанныеОтвета;
КонецФункции


#КонецОбласти
